{
  "welcome": "Welcome to my portfolio",
  "namewelcome": "Hi, I'm Thiago Padovani",
  "job": "Software Developer",
  "navbarAbout": "About",
  "navbarExperience": "Experience",
  "navbarArticles": "Articles",
  "navbarContact": "Contact",
  "resume": "Resume",
  "aboutTitle": "About Me",
  "aboutDescription": "My name is Thiago Padovani and I'm a passionate for technology, music and creating new projects. I started my self-taught studies in web development at Udemy, discovering my passion for coding. I’ve got my Bachelor’s Front-end Development diploma by the university Openclassrooms. I have more than three years of experience which most of it working fully remote. In my current role I’m responsible for architecting and designing technical solutions for complex problems on projects, I also present demos to the client and review my team's PRs in my day to day. One of the biggest achievements in my career was when I had the opportunity to participate in a redesign of a whole supermarket e-commerce application with a high traffic flow.",
  "aboutTabSkills": "Skills",
  "aboutTabEducation": "Education",
  "solidKnowledge": "Solid knowledge:",
  "improvingKnowledge": "Improving knowledge:",
  "studying": "Studying:",
  "experience": "Experience",
  "role": "Frontend Developer",
  "role1": "Web Developer",
  "USAlocation": "USA (remote)",
  "BRlocation": "Brazil (remote)",
  "brazil": "Brazil",
  "lokaStartDate": "may 2022",
  "current": "current",
  "supernossoStartDate": "ago 2020",
  "supernossoEndDate": "apr 2022",
  "obrazulStartDate": "mar 2020",
  "obrazulEndDate": "jul 2020",
  "lokaExpecience1": "In this role I’m responsible for architecting and designing technical solutions for complex problems on the project.",
  "lokaExperience2": "Among my responsibilities are making presentations of sprint deliveries to the clients and review colleagues code including juniors and seniors.",
  "lokaExperience3": "As it’s one of my main strengths, I proposed a way to standardize the application’s responsiveness following good practices to cover the Figma breakpoints for the application to scale well.",
  "lokaExperience4": "In my current project, which is a banking web application for an American Credit Union, I managed to implement a complex nav bar based on Notion menu behavior using recursive programming.",
  "lokaExperience5": "Tech used: HTML, CSS, Styled-components, Material UI, Reactjs, JavaScript, TypeScript, Redux Tool Kit, Jest, React Testing Library and Cypress.",
  "supernossoExp1": "Performed maintenance, proposed improvements and developed new features in the e-commerce platform. Tech used: JavaScript, TypeScript, jQuery, ReactJS, HTML, CSS, Sass, Less and Vtex.",
  "supernossoExp2": "Developed new features in Supernossoemcasa website.",
  "supernossoExp3": "Participated of the whole redesign of Apoioentrega website improving the performance and UX.",
  "obrazulExp1": "Developed and promoted implementations in the company’s marketplace using technologies such as HTML, CSS, Sass, JavaScript, jQuery, Reactjs, Python, Django and PostegreSQL.",
  "obrazulExp2": "Implemented and participated in the development of client’s dashboard and the result report generator.",
  "obrazulExp3": "Using of Git as code version control system and Trello for project tasks management.",
  "myArticles": "My Articles",
  "myArticlesDesciption": "These are some of the article I wrote in Medium, you may find something interesting to read.",
  "getInTouch": "Get In Touch",
  "getInTouchDesc": "Feel free to contact me by hiting the button below. Whether you have a question, talk about new opportunities or just want to say hi, I’ll try my best to get back to you!",
  "sayHelloBtn": "Say hello",
  "readMore": "Read more",
  "buyMeACoffee": "Buy me a coffee",
  "madeWith": "Made with",
  "by": "by"
}
